'''Напишите программу для нахождения цифр четырёхзначного числа.'''

a = input()

a1 = int(a) // 1000 
a2 = int(a) // 100%10
a3 = int(a) // 10%10
a4 = int(a) % 10

print('Цифра в позиции тысяч равна', a1)
print('Цифра в позиции сотен равна', a2)
print('Цифра в позиции десятков равна', a3)
print('Цифра в позиции единиц равна', a4)
