'''Напишите программу, которая принимает целое число
x и определяет, принадлежит ли данное число указанным промежуткам. 
от -бесконечности до -3 и от 7 до +бесконечности (невключительно)'''

a = int(input())
if not (-3 < a < 7):
    print('Принадлежит')
else:
    print('Не принадлежит')
